/*
	时间： 2017.10.03 10:39
	目的： 学习指针的运算	 
*/
#include<stdio.h>

int main(void)
{
	int a[3] = {1,2,3};
	int *p,*q;
	p = &a[1];
	q = &a[2];
	printf("%#x\n",p);
	printf("%#x\n",q);
	printf("%#x\n",p-q);
	
	return 0;
}
/*
在Dev中的结果是：
--------------------------------------------------------------------


--------------------------------
Process exited after 0.04488 seconds with return value 0
Press any key to continue . . .
--------------------------------------------------------------------
总结：
	指针除了减法运算有意义外，其他都不意义。并且要在连续空间的不同存储空间。 

*/ 
